5th-Semester/Business-Communication/questions.org

* Questions
** Chp 5
1. What is the importance of skillful writing?
2. Describe the writing process and effective writing strategies. (3,5)
3. Explain the importance of readable formatting.
4. Describe the development and current usage of the business letter.
5. Describe the form of business letter.
6. Describe the purpose and form of memorandums.
7. Illustrate the form of memorandums.
8. Write some stuffs about email
9. Understand the nature and business uses of text messaging and instant messaging
10. Write some stuffs about SMS
11. Understand the nature and business uses of social networking..
12. Disadvantages of email
13. When you should avoid email/Inappropriate use of email
14. Follow email conventions and organize and write clear email messages.
15. Differences
16. What are the traits of effective email?
17. ~Will hard-copy letters diminish in importance as email continues to grow? Become obsolete? Vanish?~
18. Discuss and justify the wide range of formality used in memos & email message.
19. What factors might determine whether or not instant messaging would be an appropriate medium to use in a given situation?
** Chp 6
1. Prevalence of directness in Business
2. Describe the general plan for direct-order message.
3. Write clear, well-structured routine requests for information.
4. Write direct, orderly, and friendly answers to inquiries.
5. Compose adjustment grants that regain any lost confidence.
6. Write order acknowledgments and other thank-you messages that build goodwill.
7. Write clear and effective operational communications.
** Chp 7
1. Why are bad news messages usually written in indirect order?
2. In which cases should a bad news message be written in direct order?
3. What is the general plan for indirect message?
4. How to refuse a request?
5. Write a Claim Request
6. Adjustment refusal procedure
7. Steps for credit refusal
8. How to announce bad news to customers or employees?
9. Write an credit refusal message to refuse credit for X company.
10. Write an adjustment refusal procedure for less money given!
11. Refuse a request of a student that wants your employee dataset for his project
** Chp 8
1. Describe important strategies/advice for writing any persuasive message.
2. What are the three common types of persuasive writing?
3. ~What is the general plan for writing a persuasive message?~
4. Why write sales message?
5. Discuss ethical concerns regarding sales messages.
6. General Sales Plan / Describe the planning steps for direct mail or email sales message.
7. Compose Sales Message
8. Difference between proposals & reports.
9. Write well-organized & persuasive proposals.
10. ~Format & Formality of proposals~
11. Figure out what to propose?
12. ~Business Proposal Format~
13. Determining the appeal in sales - rational or emotional?
14. ~AIDA Model~
15. Write a rational sales message about selling a oil burner, the Catalytic Carburetor Assembly.
16. Write a sales message on selling quality candy.
17. Write a persuasive message to request an industry leader to give a lecture in your school teachers' meeting.
*** Small Info
Aristotole identified the three kinds of persuasive appeals.
** Chp 9 - Job Search & Interviews
1. How to prepare for interviews?
2. Write targeted cover messages that skillfully sell your abilities.
3. What is meant by parallelism of headings?
4. discuss some of the advantages that writing a thank-you note to the interviewer gives the writer.
** Report (Chp 10-11)
1. Explain the makeup of reports relative to length and formality.
2. Discuss the four major differences involved in writing short and long reports.
3. What is a report?
4. Outline the components of the prefatory part, the report body, the ending part and the appended parts of a long formal message.
5. Write down the difference between long report and short report
6. Write a cover letter for the report.
8. Effective Title for Report
9. How to write an executive summary?
10. Table of Contents writing
11. Designing Effective Visuals
12. What is the difference between a long report and a short report?
13. How to write a cover letter for a report?
14. ~Structural Guidelines in report~

** Chp 13 - Oral & Interpersonal Communication

1. Discuss about the prevalence of oral communication.
2. Why is oral communication important in business communication?
3. Types of Interpersonal Oral Communication
4. What are the elements of good talking?
5. Courtesy in conversation
6. What are the techniques to conduct meetings?
7. How are meeting minutes written?
8. Techniques for participating in a meeting
9. What are the ways to improve listening skills?
10. What are the ten commandments of listening?
11. How to be effective in nonverbal communication?
12. Using the phone
13. Dictating (Syllabus e nai mone hoy)
14. Discuss talking & its key elements
15. Explain the listening problem and how to solve it

** Chp 14
1. Define oral reports and differentiate between them and written reports
2. What are the techniques of delivering a good formal speech?
3. What strategies must be followed to deliver a good speech?
4. Select and organize a subject for effective formal presentation to a specific audience.
5. Plan the oral report
6. Mention the techniques of using visuals in a presentation.
7. Techniques of good Formal speeches
8. Preparing to speak / How to improve your speaking skill?
9. Virtual presentations
10. A summary list of speaking practices (Pore rakha bhalo)
11. How does the audience form impressions from appearance and physical actions?
12. Explain the principal differences between face-to-face and virtual presentations

** Chp 15
1. Why is communication across culture is important to business?
2. What are the dimensions of cultural differences?
3. What are some challenges/problems of cultural difference?
   - Body positions & movements
   - Factors of human relationship
   - Difference in Business Communication techniques
4. Language issues
   - Language equivalency issues
   - Culturally derived words
5. ~Suggestions for Communicating Across Cultures Successfully~.
6. Discuss the differences between solicited and unsolicited proposal
7. Define culture and explain its effects on cross-cultural communication.

* Exam Questions
Important Chapters: 5,8,15
- Write a memorandum. Difference between memo and business letter.
- Describe the general plan for direct-order message. or What is the general plan for indirect message?
- Three kinds of appeal
- AIDA Model
- What can you do to improve your listening skills 
- Difference between memo and business letters 
- What do you understand by audience analysis? How serious is this issue
- Nonverbal communication ta important
- How to prepare for interviews?



12. ~Business Proposal Format~
