5th-Semester/Business-Communication/questions.tex
% Created 2023-05-06 শনি 12:12
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Abhijit Paul}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Abhijit Paul},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Questions}
\label{sec:orgfb201d0}
\subsection{Chp 5}
\label{sec:orgbc82946}
\begin{enumerate}
\item What is the importance of skillful writing?
\item Describe the writing process and effective writing strategies. (3,5)
\item Explain the importance of readable formatting.
\item Describe the development and current usage of the business letter.
\item Describe the form of business letter.
\item Describe the purpose and form of memorandums.
\item Illustrate the form of memorandums.
\item Write some stuffs about email
\item Understand the nature and business uses of text messaging and instant messaging
\item Write some stuffs about SMS
\item Understand the nature and business uses of social networking..
\item Disadvantages of email
\item When you should avoid email/Inappropriate use of email
\item Follow email conventions and organize and write clear email messages.
\item Differences
\item What are the traits of effective email?
\item \texttt{Will hard-copy letters diminish in importance as email continues to grow? Become obsolete? Vanish?}
\item Discuss and justify the wide range of formality used in memos \& email message.
\item What factors might determine whether or not instant messaging would be an appropriate medium to use in a given situation?
\end{enumerate}
\subsection{Chp 6}
\label{sec:orgd72e4da}
\begin{enumerate}
\item Prevalence of directness in Business
\item Describe the general plan for direct-order message.
\item Write clear, well-structured routine requests for information.
\item Write direct, orderly, and friendly answers to inquiries.
\item Compose adjustment grants that regain any lost confidence.
\item Write order acknowledgments and other thank-you messages that build goodwill.
\item Write clear and effective operational communications.
\end{enumerate}
\subsection{Chp 7}
\label{sec:orgabfb87d}
\begin{enumerate}
\item Why are bad news messages usually written in indirect order?
\item In which cases should a bad news message be written in direct order?
\item What is the general plan for indirect message?
\item How to refuse a request?
\item Write a Claim Request
\item Adjustment refusal procedure
\item Steps for credit refusal
\item How to announce bad news to customers or employees?
\item Write an credit refusal message to refuse credit for X company.
\item Write an adjustment refusal procedure for less money given!
\item Refuse a request of a student that wants your employee dataset for his project
\end{enumerate}
\subsection{Chp 8}
\label{sec:orgec95043}
\begin{enumerate}
\item Describe important strategies/advice for writing any persuasive message.
\item What are the three common types of persuasive writing?
\item \texttt{What is the general plan for writing a persuasive message?}
\item Why write sales message?
\item Discuss ethical concerns regarding sales messages.
\item General Sales Plan / Describe the planning steps for direct mail or email sales message.
\item Compose Sales Message
\item Difference between proposals \& reports.
\item Write well-organized \& persuasive proposals.
\item \texttt{Format \& Formality of proposals}
\item Figure out what to propose?
\item \texttt{Business Proposal Format}
\item Determining the appeal in sales - rational or emotional?
\item \texttt{AIDA Model}
\item Write a rational sales message about selling a oil burner, the Catalytic Carburetor Assembly.
\item Write a sales message on selling quality candy.
\item Write a persuasive message to request an industry leader to give a lecture in your school teachers' meeting.
\end{enumerate}
\subsubsection{Small Info}
\label{sec:orga3c4809}
Aristotole identified the three kinds of persuasive appeals.
\subsection{Chp 9 - Job Search \& Interviews}
\label{sec:org41e96f2}
\begin{enumerate}
\item How to prepare for interviews?
\item Write targeted cover messages that skillfully sell your abilities.
\item What is meant by parallelism of headings?
\item discuss some of the advantages that writing a thank-you note to the interviewer gives the writer.
\end{enumerate}
\subsection{Report (Chp 10-11)}
\label{sec:org8f6cc6e}
\begin{enumerate}
\item Explain the makeup of reports relative to length and formality.
\item Discuss the four major differences involved in writing short and long reports.
\item What is a report?
\item Outline the components of the prefatory part, the report body, the ending part and the appended parts of a long formal message.
\item Write down the difference between long report and short report
\item Write a cover letter for the report.
\item Effective Title for Report
\item How to write an executive summary?
\item Table of Contents writing
\item Designing Effective Visuals
\item What is the difference between a long report and a short report?
\item How to write a cover letter for a report?
\item \texttt{Structural Guidelines in report}
\end{enumerate}

\subsection{Chp 13 - Oral \& Interpersonal Communication}
\label{sec:orga19f46f}

\begin{enumerate}
\item Discuss about the prevalence of oral communication.
\item Why is oral communication important in business communication?
\item Types of Interpersonal Oral Communication
\item What are the elements of good talking?
\item Courtesy in conversation
\item What are the techniques to conduct meetings?
\item How are meeting minutes written?
\item Techniques for participating in a meeting
\item What are the ways to improve listening skills?
\item What are the ten commandments of listening?
\item How to be effective in nonverbal communication?
\item Using the phone
\item Dictating (Syllabus e nai mone hoy)
\item Discuss talking \& its key elements
\item Explain the listening problem and how to solve it
\end{enumerate}

\subsection{Chp 14}
\label{sec:org578caf9}
\begin{enumerate}
\item Define oral reports and differentiate between them and written reports
\item What are the techniques of delivering a good formal speech?
\item What strategies must be followed to deliver a good speech?
\item Select and organize a subject for effective formal presentation to a specific audience.
\item Plan the oral report
\item Mention the techniques of using visuals in a presentation.
\item Techniques of good Formal speeches
\item Preparing to speak / How to improve your speaking skill?
\item Virtual presentations
\item A summary list of speaking practices (Pore rakha bhalo)
\item How does the audience form impressions from appearance and physical actions?
\item Explain the principal differences between face-to-face and virtual presentations
\end{enumerate}

\subsection{Chp 15}
\label{sec:org27680bd}
\begin{enumerate}
\item Why is communication across culture is important to business?
\item What are the dimensions of cultural differences?
\item What are some challenges/problems of cultural difference?
\begin{itemize}
\item Body positions \& movements
\item Factors of human relationship
\item Difference in Business Communication techniques
\end{itemize}
\item Language issues
\begin{itemize}
\item Language equivalency issues
\item Culturally derived words
\end{itemize}
\item \texttt{Suggestions for Communicating Across Cultures Successfully}.
\item Discuss the differences between solicited and unsolicited proposal
\item Define culture and explain its effects on cross-cultural communication.
\end{enumerate}

\section{Exam Questions}
\label{sec:org4aabeb0}
Important Chapters: 5,8,15
\begin{itemize}
\item Write a memorandum. Difference between memo and business letter.
\item Describe the general plan for direct-order message. or What is the general plan for indirect message?
\item Three kinds of appeal
\item AIDA Model
\item What can you do to improve your listening skills
\item Difference between memo and business letters
\item What do you understand by audience analysis? How serious is this issue
\item Nonverbal communication ta important
\item How to prepare for interviews?
\end{itemize}



\begin{enumerate}
\item \texttt{Business Proposal Format}
\end{enumerate}
\end{document}